from enum import Enum


class MenuButtons(str, Enum):
    BESTSELLERS = "📊 Список бестселлеров"
    REVIEWS = "🔍 Поиск рецензий"


class Messages:
    USE_MENU = "⬇️ Пожалуйста, используйте меню ⬇️"
    ENTER_BOOK_TITLE = "📖 Введите название книги на английском для поиска\n       или /cancel для отмены. (Пример: 'Gone Girl')."
    REVIEWS_NOT_FOUND = "😕 Рецензии не найдены. Нажмите 'Поиск рецензий' еще раз и попробуйте другое название."
    SELECT_ACTION = "⬇️ Выберите действие ⬇️"


class Errors:
    REVIEWS_NOT_FOUND = "😕 Рецензии не найдены"
    EMPTY_TITLE_NOT_ALLOWED = "❌ Название не может быть пустым"
    TITLE_TOO_SHORT = "❌ Слишком короткое название"
    DATA_OUT_OF_DATE = "❌ Данные устарели"
    FAILED_TO_LOAD_PAGE = "❌ Не удалось загрузить страницу"
    SEARCH_CANCELLED = "❌ Поиск отменён"
    NYT_API_ERROR = "Ошибка при обращении к NYT API"
    NYT_API_TIMEOUT = "Превышено время ожидания ответа от NYT API"
